import React from 'react';

function Page2() {
  return ( 
    <div>
      <text>Предметна галузь веб-сайту онлайн-магазину продуктів охоплює широкий спектр аспектів, включаючи, але не обмежуючись такими:
        Каталог продуктів: Сайт має включати детальний та організований каталог продуктів, який містить різноманітні категорії (наприклад, фрукти, овочі, м'ясо, молочні продукти, зернові, напої тощо). Кожний продукт має мати відповідну інформацію, включаючи ціну, фото, опис, виробника, вагу/об'єм, дату придатності та інші важливі характеристики.
        Корзина для покупок: Користувачі мають мати можливість додавати товари до своєї корзини для покупок, оглядати її, вносити зміни в кількість товарів або видаляти їх з корзини.
        Інформація про доставку та оплату: Сайт має надавати повну інформацію про доступні методи доставки та оплати, включаючи вартість доставки, час доставки, географічні обмеження, режим роботи та ін.
        Реєстрація та особистий кабінет: Користувачі повинні мати можливість реєстрації та створення особистого кабінету, де вони можуть відслідковувати статус своїх замовлень, переглядати історію покупок, зберігати адресу доставки та контактні дані, налаштовувати персональні налаштування та вибрані товари.
        Відгуки та рейтинги: Сайт має мати функціональність для залишення відгуків та рейтингів на товари. Відгуки допомагають іншим користувачам приймати рішення про покупку, а також забезпечують зворот</text>
    </div>
  );
}

export default Page2;
