import React from 'react';

function Page5() {
  return <div>
    <strong>Висновок: </strong>Під час виконання лабораторної роботи було придбано практичні навички роботи верстки сторінок засобами CSS, верстки на основі плаваючих елементів, з’ясовано переваги та недоліки типів макетів веб-сторінок, а саме створення веб-додатків за допомогою таблиці є простішим але менш гнучким, особливо для додатків зі складнішою логікою, а за допомогою блоків навпаки, вони краще підходять для складних та інтеративних додатків та придбано практичні навички роботи верстки сторінок засобами CSS та FLEXBOX.
    </div>;
}

export default Page5;
