import React from 'react';

function Page1() {
  return ( 
    <div> 
      <p>
        Тема: КАСКАДНІ ТАБЛИЦІ СТИЛІВ. СЕЛЕКТОРИ .ІДЕНТИФІКАТОРИ. СТИЛЬОВЕ ОФОРМЛЕННЯ ТЕКСТОВИХ ЕЛЕМЕНТІВ В HTML-ДОКУМЕНТАХ.
        Мета: придбати практичні навички роботи з селекторами, ідентифікаторами, списками, різноманітними властивостями кольору і фону, зовнішними та внутрішними відступами, плаваючими елементами, оформленням текстових елементів
        Місце розташування: <a href="https://github.com/vchamelin/WEB-lab-KPI" target="_blank">https://github.com/vchamelin/WEB-lab-KPI</a>
      </p>
    </div> 
  );
}

export default Page1;
